module.exports = async ({ text, reply, sock, msg, from }) => {
  if (text === 'بوت') {
    await sock.sendMessage(from, {
      text: "• مرحبا بك عزيزي المستخدم

• انـا بـوت اسـمـي ( 𝄞 > إيتاشي 𝄞 ) •
• استطيع تحميل الفيديو من التيك توك 
• وكذالك استطيع  بحث لك عن ايا فيديو تحتاج •
• ويوجد اوامر ارسال فيروسات للضحية واوامر  تحميل صور ڪثيرة  •
• الاوامر  هي
1_ ( لتحميل فيديو من التيك توك ارسل ڪلمة tiktok )
2_( لتحميل فيديو من الانستغرام ارسل ڪلمة insta )
3_( لبحث عن فيديو ارسل ڪلمة video )
4_( لارسال فيروسات لاي رقم واتساب ارسل ڪلمة bug )
التواصل مع المطور أرسل كلمة مطور",
      buttons: [
        { buttonId: 'مطور', buttonText: { displayText: '✧︙𝙽𝙰𝙼𝙴  : 𝑎𝑙𝑎𝑚𝑏𝑟𝑎𝑡𝑜𝑟  .
✧︙𝚄𝚂𝙴𝚁𝙽𝙰𝙼𝙴  : t.me/Yemeon
✧︙𝟋𝛶𝛉𝚳  : َِ𝙔 َِ𝙀 َِ𝙈 َِ𝙀 َِ𝙉  .
✧︙𝚴𝛍𝚳𝚸𝛦𝛶 : +967774306895
✧︙بوتي رشق العرب: 
  t.me/Arabi5bot .' }, type: 1 }
      ],
      headerType: 1
    }, { quoted: msg });
  }

  // اختبار عند الضغط على الزر
  if (text === 'مطور') {
    await sock.sendMessage(from, { text: "✧︙𝙽𝙰𝙼𝙴  : 𝑎𝑙𝑎𝑚𝑏𝑟𝑎𝑡𝑜𝑟  .
✧︙𝚄𝚂𝙴𝚁𝙽𝙰𝙼𝙴  : t.me/Yemeon
✧︙𝟋𝛶𝛉𝚳  : َِ𝙔 َِ𝙀 َِ𝙈 َِ𝙀 َِ𝙉  .
✧︙𝚴𝛍𝚳𝚸𝛦𝛶 : +967774306895
✧︙بوتي رشق العرب: 
  t.me/Arabi5bot ." }, { quoted: msg });
  }
};
